; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph3 - mode
	infrared5 - mode
	thermograph4 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation11 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Star8 - direction
	GroundStation10 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 infrared5)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star8)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star3)
	(supports instrument3 image1)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Star14)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 thermograph2)
	(have_image Star13 infrared5)
	(have_image Star14 infrared5)
	(have_image Planet15 thermograph2)
	(have_image Planet15 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation10)
   goals met: 0 of 7
3. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 7
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
5. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 0 of 7
6. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 7
7. (switch_on instrument4 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument4)
   goals met: 0 of 7
8. (calibrate satellite0 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 0 of 7
9. (turn_to satellite0 phenomenon12 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 7
10. (take_image satellite0 phenomenon12 instrument4 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 1 of 7
11. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 1 of 7
12. (take_image satellite0 planet15 instrument4 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 2 of 7
13. (take_image satellite0 planet15 instrument4 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 3 of 7
14. (turn_to satellite0 star13 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star13)
   goals met: 3 of 7
15. (take_image satellite0 star13 instrument4 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 4 of 7
16. (switch_off instrument4 satellite0)
   deleted: (power_on instrument4)
   added: (power_avail satellite0)
   goals met: 4 of 7
17. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 7
18. (turn_to satellite0 groundstation5 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation5)
   goals met: 4 of 7
19. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 4 of 7
20. (turn_to satellite0 star13 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
21. (take_image satellite0 star13 instrument0 infrared5)
   added: (have_image star13 infrared5)
   goals met: 5 of 7
22. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 7
23. (take_image satellite0 star14 instrument0 infrared5)
   added: (have_image star14 infrared5)
   goals met: 7 of 7
